RuslanRussel/PSoC_6_MCU/libs/csdidac/cy_csdidac.c
/***************************************************************************//**
* \file cy_csdidac.c
* \version 2.0
*
* \brief
* This file provides the CSD HW block IDAC functionality implementation.
*
********************************************************************************
* \copyright
* Copyright 2019, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include "cy_device_headers.h"
#include "cy_syslib.h"
#include "cy_syspm.h"
#include "cy_csdidac.h"
#include "cy_gpio.h"
#include "cy_csd.h"

#if defined(CY_IP_MXCSDV2)


/*******************************************************************************
* Function Prototypes - Internal Functions
*******************************************************************************/
/**
* \cond SECTION_CSDIDAC_INTERNAL
* \addtogroup group_csdidac_internal
* \{
*/
static void Cy_CSDIDAC_ConnectChannelA(cy_stc_csdidac_context_t * context);
static void Cy_CSDIDAC_ConnectChannelB(cy_stc_csdidac_context_t * context);
static void Cy_CSDIDAC_DisconnectChannelA(cy_stc_csdidac_context_t * context);
static void Cy_CSDIDAC_DisconnectChannelB(cy_stc_csdidac_context_t * context);
/** \}
* \endcond */


/*******************************************************************************
* Local Definition
*******************************************************************************/
#define CY_CSDIDAC_FSM_ABORT                        (0x08u)

/* IDAC configuration register */
/* +--------+---------------+-------------------------------------------------------------------+
 * |  BITS  |   FIELD       |             DEFAULT MODE                                          |
 * |--------|---------------|-------------------------------------------------------------------|
 * | 6:0    | VAL           | 0x00(Sets the IDAC value to "0")                                  |
 * | 7      | POL_STATIC    | 0x00(Sets the static IDAC polarity)                               |
 * | 9:8    | POLARITY      | 0x00(IDAC polarity SOURCE)                                        |
 * | 11:10  | BAL_MODE      | 0x00(IDAC is enabled in PHI2 and disabled at the end of balancing)|
 * | 17:16  | LEG1_MODE     | 0x00(Configures LEG1 to GP_static mode)                           |
 * | 19:18  | LEG2_MODE     | 0x00(Configures LEG1 to GP_static mode)                           |
 * | 21     | DSI_CTRL_EN   | 0x00(The IDAC DSI control is disabled)                            |
 * | 23:22  | RANGE         | 0x00(Sets the range parameter value to low: 1LSB = 37.5 nA)       |
 * | 24     | LEG1_EN       | 0x00(The output for LEG1 is disabled)                             |
 * | 25     | LEG2_EN       | 0x00(The output for LEG2 is disabled)                             |
 * +--------+---------------+-------------------------------------------------------------------+*/
#define CY_CSDIDAC_DEFAULT_CFG                      (0x01800000uL)
#define CY_CSDIDAC_POLARITY_POS                     (8uL)
#define CY_CSDIDAC_POLARITY_MASK                    (3uL << CY_CSDIDAC_POLARITY_POS)
#define CY_CSDIDAC_LSB_POS                          (22uL)
#define CY_CSDIDAC_LSB_MASK                         (3uL << CY_CSDIDAC_LSB_POS)
#define CY_CSDIDAC_LEG1_EN_POS                      (24uL)
#define CY_CSDIDAC_LEG1_EN_MASK                     (1uL << CY_CSDIDAC_LEG1_EN_POS)
#define CY_CSDIDAC_LEG2_EN_POS                      (25uL)
#define CY_CSDIDAC_LEG2_EN_MASK                     (1uL << CY_CSDIDAC_LEG2_EN_POS)
#define CY_CSDIDAC_RANGE_MASK                       (CY_CSDIDAC_LSB_MASK | CY_CSDIDAC_LEG1_EN_MASK | CY_CSDIDAC_LEG2_EN_MASK)

/* 
* All the defines below correspond to IDAC LSB in pA
*/
#define CY_CSDIDAC_LSB_37                           (  37500u)
#define CY_CSDIDAC_LSB_75                           (  75000u)
#define CY_CSDIDAC_LSB_300                          ( 300000u)
#define CY_CSDIDAC_LSB_600                          ( 600000u)
#define CY_CSDIDAC_LSB_2400                         (2400000u)
#define CY_CSDIDAC_LSB_4800                         (4800000u)

#define CY_CSDIDAC_LSB_37_MAX_CURRENT             (  4762500u)
#define CY_CSDIDAC_LSB_75_MAX_CURRENT             (  9525000u)
#define CY_CSDIDAC_LSB_300_MAX_CURRENT            ( 38100000u)
#define CY_CSDIDAC_LSB_600_MAX_CURRENT            ( 76200000u)
#define CY_CSDIDAC_LSB_2400_MAX_CURRENT           (304800000u)
#define CY_CSDIDAC_LSB_4800_MAX_CURRENT           (609600000u)

#define CY_CSDIDAC_CODE_MASK                        (127u)
#define CY_CSDIDAC_CONST_2                          (2u)
#define CY_CSDIDAC_CONST_10                         (10u)
#define CY_CSDIDAC_CONST_1000                       (1000u)
#define CY_CSDIDAC_CONST_1000000                    (1000000u)

/* CSD HW block CONFIG register definitions */
#define CY_CSDIDAC_CSD_REG_CONFIG_INIT              (0x80001000uL)
#define CY_CSDIDAC_CSD_REG_CONFIG_DEFAULT           (CY_CSDIDAC_CSD_REG_CONFIG_INIT)

/* CSD_INTR register masks */
#define CY_CSDIDAC_CSD_INTR_SAMPLE_MSK              (0x00000001uL)
#define CY_CSDIDAC_CSD_INTR_INIT_MSK                (0x00000002uL)
#define CY_CSDIDAC_CSD_INTR_ADC_RES_MSK             (0x00000100uL)
#define CY_CSDIDAC_CSD_INTR_ALL_MSK                 (CY_CSDIDAC_CSD_INTR_SAMPLE_MSK | \
                                                     CY_CSDIDAC_CSD_INTR_INIT_MSK | \
                                                     CY_CSDIDAC_CSD_INTR_ADC_RES_MSK)
/* CSD_INTR_MASK register masks */
#define CY_CSDIDAC_CSD_INTR_MASK_SAMPLE_MSK         (0x00000001uL)
#define CY_CSDIDAC_CSD_INTR_MASK_INIT_MSK           (0x00000002uL)
#define CY_CSDIDAC_CSD_INTR_MASK_ADC_RES_MSK        (0x00000100uL)
#define CY_CSDIDAC_CSD_INTR_MASK_CLEAR_MSK          (0x00000000uL)

/* Switch definitions */
#define CY_CSDIDAC_SW_BYPA_ENABLE                   (0x00001000uL)
#define CY_CSDIDAC_SW_BYPB_ENABLE                   (0x00010000uL)
#define CY_CSDIDAC_SW_REFGEN_SEL_IBCB_ON            (0x00000010uL)
#define CY_CSDIDAC_SW_REFGEN_SEL_IAIB_ON            (0x00000001uL)

#define CY_CSDIDAC_CSD_CONFIG_DEFAULT  {\
    .config         = 0x80001000uL,\
    .spare          = 0x00000000uL,\
    .status         = 0x00000000uL,\
    .statSeq        = 0x00000000uL,\
    .statCnts       = 0x00000000uL,\
    .statHcnt       = 0x00000000uL,\
    .resultVal1     = 0x00000000uL,\
    .resultVal2     = 0x00000000uL,\
    .adcRes         = 0x00000000uL,\
    .intr           = 0x00000000uL,\
    .intrSet        = 0x00000000uL,\
    .intrMask       = 0x00000000uL,\
    .intrMasked     = 0x00000000uL,\
    .hscmp          = 0x00000000uL,\
    .ambuf          = 0x00000000uL,\
    .refgen         = 0x00000000uL,\
    .csdCmp         = 0x00000000uL,\
    .swRes          = 0x00000000uL,\
    .sensePeriod    = 0x00000000uL,\
    .senseDuty      = 0x00000000uL,\
    .swHsPosSel     = 0x00000000uL,\
    .swHsNegSel     = 0x00000000uL,\
    .swShieldSel    = 0x00000000uL,\
    .swAmuxbufSel   = 0x00000000uL,\
    .swBypSel       = 0x00000000uL,\
    .swCmpPosSel    = 0x00000000uL,\
    .swCmpNegSel    = 0x00000000uL,\
    .swRefgenSel    = CY_CSDIDAC_SW_REFGEN_SEL_IBCB_ON,\
    .swFwModSel     = 0x00000000uL,\
    .swFwTankSel    = 0x00000000uL,\
    .swDsiSel       = 0x00000000uL,\
    .ioSel          = 0x00000000uL,\
    .seqTime        = 0x00000000uL,\
    .seqInitCnt     = 0x00000000uL,\
    .seqNormCnt     = 0x00000000uL,\
    .adcCtl         = 0x00000000uL,\
    .seqStart       = 0x00000000uL,\
    .idacA          = 0x00000000uL,\
    .idacB          = 0x00000000uL,\
    }

    
